app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "get in dat"], ["created_at", Mon, 06 Jan 2014 20:24:29 UTC +00:00], ["title", "whaa"], ["updated_at", Mon, 06 Jan 2014 20:24:29 UTC +00:00]]

  def update
    @post = Post.find(params[:id])
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "body" = 'get next to dat space heater', "title" = 'okayyyyyyy', "updated_at" = '2014-01-07 21:03:08.005756' WHERE "posts"."id" = 1